name: "HeatmapStructNet2"

layer {
  name: "data" 
  type: "DataHeatmap"
  top: "data"
  top: "label"
  visualise: false   
  include: { phase: TRAIN }   
  heatmap_data_param {
    source: "data/flic/flic_train_cropped_multfact282/train_shuffle.txt"
    root_img_dir: "data/flic/flic_train_cropped_multfact282/"
#    meanfile: "data/flic/FLIC_mean.binaryproto"    
    batchsize: 7
    cropsize: 248
    outsize: 256
    sample_per_cluster: false
    random_crop: true
    label_width: 64
    label_height: 64
    segmentation: false
    flip_joint_labels: true
    dont_flip_first: true
    angle_max: 40    
    multfact: 282  # set to 282 if using preprocessed data from website
  }
}
layer {
  name: "data"
  type: "DataHeatmap"
  top: "data"
  top: "label"
  visualise: false    
  include: { phase: TEST }
  heatmap_data_param {
    source: "data/flic/flic_test_cropped_multfact282/test_shuffle.txt"
    root_img_dir: "data/flic/flic_test_cropped_multfact282/"
#    meanfile: "data/flic/FLIC_mean.binaryproto"
    batchsize: 1
    cropsize: 248
    outsize: 256
    sample_per_cluster: false
    random_crop: false
    label_width: 64
    label_height: 64  
    segmentation: false
    dont_flip_first: true
    angle_max: 0
    multfact: 282  # set to 282 if using preprocessed data from website
  }
}
#########################################################
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
#########################################################
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 9
    pad: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
#########################################################
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 9
    pad: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
#########################################################
layer {
  name: "conv6"
  type: "Convolution"
  bottom: "conv5"
  top: "conv6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
#    pad: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv6"
  top: "conv6"
}
#########################################################
layer {
  name: "conv7"
  type: "Convolution"
  bottom: "conv6"
  top: "conv7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv7"
  top: "conv7"
}
#########################################################
layer {
  name: "conv8"
  type: "Convolution"
  bottom: "conv7"
  top: "conv8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu8"
  type: "ReLU"
  bottom: "conv8"
  top: "conv8"
}



#########################################################


layer {
  name: "loss_heatmap"
  type: "EuclideanLossHeatmap"
  bottom: "conv8"
  bottom: "label"
  bottom: "data"  
  top: "loss_heatmap"  
  visualise: false
  loss_weight: 1  
}















#########################################################
layer {
  name: "concat_fusion"
  type: "Concat"
  bottom: "conv3"
  bottom: "conv7"
  top: "concat_fusion"
  concat_param {
    concat_dim: 1
  }
}



#########################################################
layer {
  name: "conv1_fusion"
  type: "Convolution"
  bottom: "concat_fusion"
  top: "conv1_fusion"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 9
    stride: 1
    pad: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_fusion"
  type: "ReLU"
  bottom: "conv1_fusion"
  top: "conv1_fusion"
}

#########################################################
layer {
  name: "conv2_fusion"
  type: "Convolution"
  bottom: "conv1_fusion"
  top: "conv2_fusion"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_fusion"
  type: "ReLU"
  bottom: "conv2_fusion"
  top: "conv2_fusion"
}

#########################################################
layer {
  name: "conv3_fusion"
  type: "Convolution"
  bottom: "conv2_fusion"
  top: "conv3_fusion"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_fusion"
  type: "ReLU"
  bottom: "conv3_fusion"
  top: "conv3_fusion"
}

#########################################################add by ai#######################################
layer {
  name: "conv4_fusion"
  type: "Convolution"
  bottom: "conv3_fusion"
  top: "conv4_fusion"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 9
    stride: 1
    pad: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_fusion"
  type: "ReLU"
  bottom: "conv4_fusion"
  top: "conv4_fusion"
}
##################################################################################################################
layer {
  name: "conv5_fusion"
  type: "Convolution"
  bottom: "conv4_fusion"
  top: "conv5_fusion"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_fusion"
  type: "ReLU"
  bottom: "conv5_fusion"
  top: "conv5_fusion"
}
#########################################################
layer {
  name: "conv6_fusion"
  type: "Convolution"
  bottom: "conv5_fusion"
  top: "conv6_fusion"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

#########################################################
layer {
  name: "loss_fusion"
  type: "EuclideanLossHeatmap"
  bottom: "conv6_fusion"
  bottom: "label"
  bottom: "data"  
  top: "loss_fusion"
  visualise: false
  loss_weight: 3
}
##################################################################################
##                            add conv3_data1                                   ##
##################################################################################
layer {
  name: "conv1_data1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_data1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_data1"
  type: "ReLU"
  bottom: "conv1_data1"
  top: "conv1_data1"
}
layer {
  name: "pool1_data1"
  type: "Pooling"
  bottom: "conv1_data1"
  top: "pool1_data1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2_data1"
  type: "Convolution"
  bottom: "pool1_data1"
  top: "conv2_data1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_data1"
  type: "ReLU"
  bottom: "conv2_data1"
  top: "conv2_data1"
}
layer {
  name: "pool2_data1"
  type: "Pooling"
  bottom: "conv2_data1"
  top: "pool2_data1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3_data1"
  type: "Convolution"
  bottom: "pool2_data1"
  top: "conv3_data1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_data1"
  type: "ReLU"
  bottom: "conv3_data1"
  top: "conv3_data1"
}
##################################################################################
##                            add conv3_data2                                   ##
##################################################################################
layer {
  name: "conv1_data2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_data2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_data2"
  type: "ReLU"
  bottom: "conv1_data2"
  top: "conv1_data2"
}
layer {
  name: "pool1_data2"
  type: "Pooling"
  bottom: "conv1_data2"
  top: "pool1_data2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2_data2"
  type: "Convolution"
  bottom: "pool1_data2"
  top: "conv2_data2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_data2"
  type: "ReLU"
  bottom: "conv2_data2"
  top: "conv2_data2"
}
layer {
  name: "pool2_data2"
  type: "Pooling"
  bottom: "conv2_data2"
  top: "pool2_data2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3_data2"
  type: "Convolution"
  bottom: "pool2_data2"
  top: "conv3_data2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_data2"
  type: "ReLU"
  bottom: "conv3_data2"
  top: "conv3_data2"
}
##################################################################################
##                            add conv3_data3                                   ##
##################################################################################
layer {
  name: "conv1_data3"
  type: "Convolution"
  bottom: "data"
  top: "conv1_data3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_data3"
  type: "ReLU"
  bottom: "conv1_data3"
  top: "conv1_data3"
}
layer {
  name: "pool1_data3"
  type: "Pooling"
  bottom: "conv1_data3"
  top: "pool1_data3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2_data3"
  type: "Convolution"
  bottom: "pool1_data3"
  top: "conv2_data3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_data3"
  type: "ReLU"
  bottom: "conv2_data3"
  top: "conv2_data3"
}
layer {
  name: "pool2_data3"
  type: "Pooling"
  bottom: "conv2_data3"
  top: "pool2_data3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3_data3"
  type: "Convolution"
  bottom: "pool2_data3"
  top: "conv3_data3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_data3"
  type: "ReLU"
  bottom: "conv3_data3"
  top: "conv3_data3"
}
##################################################################################
##                            add conv3_data4                                   ##
##################################################################################
layer {
  name: "conv1_data4"
  type: "Convolution"
  bottom: "data"
  top: "conv1_data4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_data4"
  type: "ReLU"
  bottom: "conv1_data4"
  top: "conv1_data4"
}
layer {
  name: "pool1_data4"
  type: "Pooling"
  bottom: "conv1_data4"
  top: "pool1_data4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2_data4"
  type: "Convolution"
  bottom: "pool1_data4"
  top: "conv2_data4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_data4"
  type: "ReLU"
  bottom: "conv2_data4"
  top: "conv2_data4"
}
layer {
  name: "pool2_data4"
  type: "Pooling"
  bottom: "conv2_data4"
  top: "pool2_data4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3_data4"
  type: "Convolution"
  bottom: "pool2_data4"
  top: "conv3_data4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_data4"
  type: "ReLU"
  bottom: "conv3_data4"
  top: "conv3_data4"
}
##################################################################################
##                            add conv3_data5                                   ##
##################################################################################
layer {
  name: "conv1_data5"
  type: "Convolution"
  bottom: "data"
  top: "conv1_data5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_data5"
  type: "ReLU"
  bottom: "conv1_data5"
  top: "conv1_data5"
}
layer {
  name: "pool1_data5"
  type: "Pooling"
  bottom: "conv1_data5"
  top: "pool1_data5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2_data5"
  type: "Convolution"
  bottom: "pool1_data5"
  top: "conv2_data5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_data5"
  type: "ReLU"
  bottom: "conv2_data5"
  top: "conv2_data5"
}
layer {
  name: "pool2_data5"
  type: "Pooling"
  bottom: "conv2_data5"
  top: "pool2_data5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3_data5"
  type: "Convolution"
  bottom: "pool2_data5"
  top: "conv3_data5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_data5"
  type: "ReLU"
  bottom: "conv3_data5"
  top: "conv3_data5"
}
##################################################################################
##                            add conv3_data6                                   ##
##################################################################################
layer {
  name: "conv1_data6"
  type: "Convolution"
  bottom: "data"
  top: "conv1_data6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_data6"
  type: "ReLU"
  bottom: "conv1_data6"
  top: "conv1_data6"
}
layer {
  name: "pool1_data6"
  type: "Pooling"
  bottom: "conv1_data6"
  top: "pool1_data6"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2_data6"
  type: "Convolution"
  bottom: "pool1_data6"
  top: "conv2_data6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_data6"
  type: "ReLU"
  bottom: "conv2_data6"
  top: "conv2_data6"
}
layer {
  name: "pool2_data6"
  type: "Pooling"
  bottom: "conv2_data6"
  top: "pool2_data6"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3_data6"
  type: "Convolution"
  bottom: "pool2_data6"
  top: "conv3_data6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_data6"
  type: "ReLU"
  bottom: "conv3_data6"
  top: "conv3_data6"
}
##################################################################################
##                            add conv3_data7                                   ##
##################################################################################
layer {
  name: "conv1_data7"
  type: "Convolution"
  bottom: "data"
  top: "conv1_data7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_data7"
  type: "ReLU"
  bottom: "conv1_data7"
  top: "conv1_data7"
}
layer {
  name: "pool1_data7"
  type: "Pooling"
  bottom: "conv1_data7"
  top: "pool1_data7"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv2_data7"
  type: "Convolution"
  bottom: "pool1_data7"
  top: "conv2_data7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_data7"
  type: "ReLU"
  bottom: "conv2_data7"
  top: "conv2_data7"
}
layer {
  name: "pool2_data7"
  type: "Pooling"
  bottom: "conv2_data7"
  top: "pool2_data7"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#########################################################
layer {
  name: "conv3_data7"
  type: "Convolution"
  bottom: "pool2_data7"
  top: "conv3_data7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_data7"
  type: "ReLU"
  bottom: "conv3_data7"
  top: "conv3_data7"
}
##################################################################################
##################################################################################
##add for struct layer##
##################################################################################
layer {
  name: "slicer_conv6_fusion"
  type: "Slice"
  bottom: "conv6_fusion"
  top: "fusion6_1"
  top: "fusion6_2"
  top: "fusion6_3"
  top: "fusion6_4"
  top: "fusion6_5"
  top: "fusion6_6"
  top: "fusion6_7"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
  }
}
##################################################################################
## for joint 1 ##
layer {
  name: "concat_joint1"
  type: "Concat"
  bottom: "fusion6_1"
  bottom: "fusion6_6"
  bottom: "fusion6_7"
  bottom: "conv3_data1"
  top: "concat_joint1"
  concat_param {
    concat_dim: 1
  }
}
######################################
layer {
  name: "conv1_joint1"
  type: "Convolution"
  bottom: "concat_joint1"
  top: "conv1_joint1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_joint1"
  type: "ReLU"
  bottom: "conv1_joint1"
  top: "conv1_joint1"
}
#####################################################################################
## for joint 2 ##
layer {
  name: "concat_joint2"
  type: "Concat"
  bottom: "fusion6_2"
  bottom: "fusion6_3"
  bottom: "fusion6_4"
  bottom: "conv3_data2"
  top: "concat_joint2"
  concat_param {
    concat_dim: 1
  }
}
######################################
layer {
  name: "conv1_joint2"
  type: "Convolution"
  bottom: "concat_joint2"
  top: "conv1_joint2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_joint2"
  type: "ReLU"
  bottom: "conv1_joint2"
  top: "conv1_joint2"
}
##################################################################################
## for joint 3 ##
layer {
  name: "concat_joint3"
  type: "Concat"
  bottom: "fusion6_2"
  bottom: "fusion6_3"
  bottom: "fusion6_5"
  bottom: "conv3_data3"
  top: "concat_joint3"
  concat_param {
    concat_dim: 1
  }
}
######################################
layer {
  name: "conv1_joint3"
  type: "Convolution"
  bottom: "concat_joint3"
  top: "conv1_joint3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_joint3"
  type: "ReLU"
  bottom: "conv1_joint3"
  top: "conv1_joint3"
}
##################################################################################
## for joint 4 ##
layer {
  name: "concat_joint4"
  type: "Concat"
  bottom: "fusion6_2"
  bottom: "fusion6_4"
  bottom: "fusion6_5"
  bottom: "fusion6_6"
  bottom: "conv3_data4"
  top: "concat_joint4"
  concat_param {
    concat_dim: 1
  }
}
######################################
layer {
  name: "conv1_joint4"
  type: "Convolution"
  bottom: "concat_joint4"
  top: "conv1_joint4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_joint4"
  type: "ReLU"
  bottom: "conv1_joint4"
  top: "conv1_joint4"
}
##################################################################################
## for joint 5 ##
layer {
  name: "concat_joint5"
  type: "Concat"
  bottom: "fusion6_3"
  bottom: "fusion6_4"
  bottom: "fusion6_5"
  bottom: "fusion6_7"
  bottom: "conv3_data5"
  top: "concat_joint5"
  concat_param {
    concat_dim: 1
  }
}
######################################
layer {
  name: "conv1_joint5"
  type: "Convolution"
  bottom: "concat_joint5"
  top: "conv1_joint5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_joint5"
  type: "ReLU"
  bottom: "conv1_joint5"
  top: "conv1_joint5"
}
##################################################################################
## for joint 6 ##
layer {
  name: "concat_joint6"
  type: "Concat"
  bottom: "fusion6_1"
  bottom: "fusion6_4"
  bottom: "fusion6_6"
  bottom: "fusion6_7"
  bottom: "conv3_data6"
  top: "concat_joint6"
  concat_param {
    concat_dim: 1
  }
}
######################################
layer {
  name: "conv1_joint6"
  type: "Convolution"
  bottom: "concat_joint6"
  top: "conv1_joint6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_joint6"
  type: "ReLU"
  bottom: "conv1_joint6"
  top: "conv1_joint6"
}
##################################################################################
## for joint 7 ##
layer {
  name: "concat_joint7"
  type: "Concat"
  bottom: "fusion6_1"
  bottom: "fusion6_5"
  bottom: "fusion6_6"
  bottom: "fusion6_7"
  bottom: "conv3_data7"
  top: "concat_joint7"
  concat_param {
    concat_dim: 1
  }
}
######################################
layer {
  name: "conv1_joint7"
  type: "Convolution"
  bottom: "concat_joint7"
  top: "conv1_joint7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_joint7"
  type: "ReLU"
  bottom: "conv1_joint7"
  top: "conv1_joint7"
}
####################################################################################
####################################################################################
##             conv2_joint i                                                      ##
####################################################################################
layer {
  name: "conv2_joint1"
  type: "Convolution"
  bottom: "conv1_joint1"
  top: "conv2_joint1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_joint1"
  type: "ReLU"
  bottom: "conv2_joint1"
  top: "conv2_joint1"
}
####################################################################################
layer {
  name: "conv2_joint2"
  type: "Convolution"
  bottom: "conv1_joint2"
  top: "conv2_joint2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_joint2"
  type: "ReLU"
  bottom: "conv2_joint2"
  top: "conv2_joint2"
}
####################################################################################
layer {
  name: "conv2_joint3"
  type: "Convolution"
  bottom: "conv1_joint3"
  top: "conv2_joint3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_joint3"
  type: "ReLU"
  bottom: "conv2_joint3"
  top: "conv2_joint3"
}
####################################################################################
layer {
  name: "conv2_joint4"
  type: "Convolution"
  bottom: "conv1_joint4"
  top: "conv2_joint4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_joint4"
  type: "ReLU"
  bottom: "conv2_joint4"
  top: "conv2_joint4"
}
####################################################################################
layer {
  name: "conv2_joint5"
  type: "Convolution"
  bottom: "conv1_joint5"
  top: "conv2_joint5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_joint5"
  type: "ReLU"
  bottom: "conv2_joint5"
  top: "conv2_joint5"
}
####################################################################################
layer {
  name: "conv2_joint6"
  type: "Convolution"
  bottom: "conv1_joint6"
  top: "conv2_joint6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_joint6"
  type: "ReLU"
  bottom: "conv2_joint6"
  top: "conv2_joint6"
}
####################################################################################
layer {
  name: "conv2_joint7"
  type: "Convolution"
  bottom: "conv1_joint7"
  top: "conv2_joint7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_joint7"
  type: "ReLU"
  bottom: "conv2_joint7"
  top: "conv2_joint7"
}
####################################################################################
####################################################################################
##             conv3_joint i                                                      ##
####################################################################################
layer {
  name: "conv3_joint1"
  type: "Convolution"
  bottom: "conv2_joint1"
  top: "conv3_joint1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_joint1"
  type: "ReLU"
  bottom: "conv3_joint1"
  top: "conv3_joint1"
}
####################################################################################
layer {
  name: "conv3_joint2"
  type: "Convolution"
  bottom: "conv2_joint2"
  top: "conv3_joint2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_joint2"
  type: "ReLU"
  bottom: "conv3_joint2"
  top: "conv3_joint2"
}
####################################################################################
layer {
  name: "conv3_joint3"
  type: "Convolution"
  bottom: "conv2_joint3"
  top: "conv3_joint3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_joint3"
  type: "ReLU"
  bottom: "conv3_joint3"
  top: "conv3_joint3"
}
####################################################################################
layer {
  name: "conv3_joint4"
  type: "Convolution"
  bottom: "conv2_joint4"
  top: "conv3_joint4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_joint4"
  type: "ReLU"
  bottom: "conv3_joint4"
  top: "conv3_joint4"
}
####################################################################################
layer {
  name: "conv3_joint5"
  type: "Convolution"
  bottom: "conv2_joint5"
  top: "conv3_joint5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_joint5"
  type: "ReLU"
  bottom: "conv3_joint5"
  top: "conv3_joint5"
}
####################################################################################
layer {
  name: "conv3_joint6"
  type: "Convolution"
  bottom: "conv2_joint6"
  top: "conv3_joint6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_joint6"
  type: "ReLU"
  bottom: "conv3_joint6"
  top: "conv3_joint6"
}
####################################################################################
layer {
  name: "conv3_joint7"
  type: "Convolution"
  bottom: "conv2_joint7"
  top: "conv3_joint7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 13
    stride: 1
    pad: 6
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_joint7"
  type: "ReLU"
  bottom: "conv3_joint7"
  top: "conv3_joint7"
}
####################################################################################
####################################################################################
##             conv4_jointi                                                       ##
####################################################################################
layer {
  name: "conv4_joint1"
  type: "Convolution"
  bottom: "conv3_joint1"
  top: "conv4_joint1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_joint1"
  type: "ReLU"
  bottom: "conv4_joint1"
  top: "conv4_joint1"
}
####################################################################################
layer {
  name: "conv4_joint2"
  type: "Convolution"
  bottom: "conv3_joint2"
  top: "conv4_joint2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_joint2"
  type: "ReLU"
  bottom: "conv4_joint2"
  top: "conv4_joint2"
}
####################################################################################
layer {
  name: "conv4_joint3"
  type: "Convolution"
  bottom: "conv3_joint3"
  top: "conv4_joint3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_joint3"
  type: "ReLU"
  bottom: "conv4_joint3"
  top: "conv4_joint3"
}
####################################################################################
layer {
  name: "conv4_joint4"
  type: "Convolution"
  bottom: "conv3_joint4"
  top: "conv4_joint4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_joint4"
  type: "ReLU"
  bottom: "conv4_joint4"
  top: "conv4_joint4"
}
####################################################################################
layer {
  name: "conv4_joint5"
  type: "Convolution"
  bottom: "conv3_joint5"
  top: "conv4_joint5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_joint5"
  type: "ReLU"
  bottom: "conv4_joint5"
  top: "conv4_joint5"
}
####################################################################################
layer {
  name: "conv4_joint6"
  type: "Convolution"
  bottom: "conv3_joint6"
  top: "conv4_joint6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_joint6"
  type: "ReLU"
  bottom: "conv4_joint6"
  top: "conv4_joint6"
}
####################################################################################
layer {
  name: "conv4_joint7"
  type: "Convolution"
  bottom: "conv3_joint7"
  top: "conv4_joint7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_joint1"
  type: "ReLU"
  bottom: "conv4_joint7"
  top: "conv4_joint7"
}
####################################################################################
####################################################################################
##             conv5_jointi                                                       ##
####################################################################################
layer {
  name: "conv5_joint1"
  type: "Convolution"
  bottom: "conv4_joint1"
  top: "conv5_joint1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
####################################################################################
layer {
  name: "conv5_joint2"
  type: "Convolution"
  bottom: "conv4_joint2"
  top: "conv5_joint2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
####################################################################################
layer {
  name: "conv5_joint3"
  type: "Convolution"
  bottom: "conv4_joint3"
  top: "conv5_joint3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
####################################################################################
layer {
  name: "conv5_joint4"
  type: "Convolution"
  bottom: "conv4_joint4"
  top: "conv5_joint4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
####################################################################################
layer {
  name: "conv5_joint5"
  type: "Convolution"
  bottom: "conv4_joint5"
  top: "conv5_joint5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
####################################################################################
layer {
  name: "conv5_joint6"
  type: "Convolution"
  bottom: "conv4_joint6"
  top: "conv5_joint6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
####################################################################################
layer {
  name: "conv5_joint7"
  type: "Convolution"
  bottom: "conv4_joint7"
  top: "conv5_joint7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
######################################################################################
######################################################################################
##                         concat 7 joint layer and add loss                        ##
layer {
  name: "concat_alljoint"
  type: "Concat"
  bottom: "conv5_joint1"
  bottom: "conv5_joint2"
  bottom: "conv5_joint3"
  bottom: "conv5_joint4"
  bottom: "conv5_joint5"
  bottom: "conv5_joint6"
  bottom: "conv5_joint7"
  top: "concat_alljoint"
  concat_param {
    concat_dim: 1
  }
}
########################################################################################
layer {
  name: "loss_alljoint"
  type: "EuclideanLossHeatmap"
  bottom: "concat_alljoint"
  bottom: "label"
  bottom: "data"  
  top: "loss_alljoint"
  visualise: false
  loss_weight: 5
}
